const textbox = document.getElementById("random-haiku-generator-textbox");
const rerollBtn = document.getElementById("reroll");

const haikuFives = [
    "チョモランマ", "大学生", "激突！", "全破壊", "エンファサイズ", "寝起きには", "FPS", "昇竜拳", "これ見てよ",
    "マキシマム", "ワーーーオ", "スレイヤー", "咎人の", "見惚れちゃう", "キュビズムを", "最上川", "古池や", "たらちねの",
    "あをによし", "しろたへの", "万札で", "クレイジー", "バーサーク", "紙ストロー", "250", "パスワード", "半端なく",
    "半殺し", "全殺し", "なりきって", "逃走中", "強盗が", "無敵読み", "逆択で", "ぶっぱなし", "ラリアット", "Amazonで",
    "最新版", "イタリアン", "内野ゴロ", "わはははは", "LDK", "どうぶつの森", "スイカ割り", "代名詞", "親戚です", "インパクト",
    "奇数日に", "そして、終わりへ", "瞬獄殺", "砕けない", "水の音", "キラッとな☆彡", "寝落ち通話", "爪剥ぎや", "チャリ盗み",
    "もう朝か", "九回裏", "十年目", "あらへんで", "魅せますか", "万事快調", "ホイル焼き", "長丁場", "ロードショー",
    "新触感", "新食感", "テスト前夜", "九時五分", "BIG MOTOR", "「そりゃないぜ」", "これ食べろ！！！！！", "カビた", "居合切り",
    "狂気的", "ギャツビー", "暴走", "暴れちゃる", "神秘的", "邪神像", "効いたよね", "パブロン", "...あれを！", "埋まってる",
    "動かぬ死体", "そろそろ", "しませんか", "ラブレター", "チャッピーを", "五里霧中", "これが限界", "マサドラへ", "卑しいなあ",
    "いやらしい", "Dreamer", "Well, Say it!", "全消去", "舐めるなよ", "ラプソディ", "ドップラー", "タンジェント", "少年よ",
    "黙秘権", "毒チワワ", "はじめまして", "胡麻麦茶", "うるせえなあ", "36000", "「終わりだな。」", "ポッケにある飴", "明日降る雨",
    "エモモモモ！", "ふと見上げ", "COUNTER!", "ああ窓に", "世迷言", "もうこりごりだ", "大ジャンプ", "ガーキャンで", "合同で",
    "コンバータ", "大爆発", "駆け抜けたい", "見せかけの", "スパゲティ", "パトロール", "パイを焼け", "祝杯だ", "三分間",
    "コマ割りで", "MOTHER2", "ツチノコを", "ナンセンス", "飛び跳ねろ", "勘違い", "踏みならせ", "これ舐めて", "大犯罪", "ペットボトル",
    "ノーベル賞", "自業自得", "右フック", "バナナチョコ", "ｷﾀ━━━━(ﾟ∀ﾟ)━━━━!!", "叫ぶ奴", "抹茶ラテ", "自信アリ", "衰えた",
    "対決！", "実験で", "ちくりんちょ", "頓珍漢", "やせ型の", "エビバディセイ", "ツーファイブ", "決戦！", "ならOKです",
    "極めましょう", "風車", "やってみた！", "やりすぎた", "チッ（舌打ち）", "ホームラン", "その走塁", "俺はなる", "ベンチャーの",
    "そうかい。", "待ったナシ", "三倍満", "絶望", "サイクロン", "ハリケーン", "酔いもせず", "ハイパーボム", "パワーボム", "暴れ馬",
    "バナナの歯磨き粉", "大工さん", "右に曲がる", "ぶっとばす", "即死コン", "FTL", "終わっとる", "他責思考", "腕ひしぎ", "巴投げ",
    "共犯者", "狂信者", "ブレーカー", "ハーモニー", "メタ思考", "レクイエム", "ウェブサイト", "本サイト", "半加算", "全加算",
    "五月雨を", "古紙回収", "とんでもねぇ", "ズダダダダ！", "Wikipedia", "我思う", "「違います。」", "RTA", "変わり者",
    "かぶきよる", "ボディーブロー", "アドバイス", "YouTube", "Twitter", "淡い花", "一人きり", "\"Bluetooth Connected\"",
    "神殺し", "かましちゃる", "放送局", "モールスで", "行ってみた！", "ネットミーム", "ネックピロー", "逆張りで", "形骸化",
    "奇を衒う", "飯一杯", "プレッツェル", "イッツミー", "\"鈍\"(にぶ)", "\\パンパカパーン/", "僕の名さ", "君の名は？", "ジーマーで",
    "バイヤーで", "売りさばく", "新聞紙", "筑前煮", "咳を", "一人", "うおおおお", "雨嵐", "車窓から", "馳せる想い", "【親展】",
    "【炎上確定】", "道開けろ", "凡ミスで", "間違えた", "「マジで？」", "太陽に", "じゃねーか！", "警察出動", "密着で", "柔道を",
    "正直ね", "サブミッション", "男一人", "ぶっ飛び～", "叫べ！", "タイフーン", "マナー講師", "役に立つ", "えげつなさ",
    "デシリットル", "「失礼します」", "ギガたくあん", "あなたには", "分かります？", "大腿筋", "使いよう", "新感覚！", "エイリアン",
    "2色展開", "ラフレシア", "飛び出した", "美しさ", "オムニバス", "キムワイプ", "三角形", "金曜日", "片思い", "コセカント",
    "エンティティ", "撃ち抜いて", "エゴサーチ", "クソリプを", "ナルシスト", "共洗い", "道標", "コップンカー", "桃のうち",
    "触れさせろ", "察してね", "一位だぞ", "ピルエット", "ラングドシャ", "ジャグリング", "アフォガード", "あほガード",
    "無言フォロー", "地元走り", "タコメーター", "イレギュラー", "続行だ", "嘲笑う", "走りだせ", "オペランド",
    "ペトリコール", "ペトリ皿", "報酬系", "RNA", "ブーバキキ", "ソレノイド", "トートロジー", "沸き潰し", "暇つぶし", "ひつまぶし",
    "トルコアイス", "天中殺", "リマスター", "ジャンボリー", "ドライバー", "野菜ジュース", "外の人", "めくるめく", "さんざめく",
    "燦燦と", "泥仕合", "電撃戦", "サクリファイス", "バベルの塔", "熱異常", "壊れない", "リミックス", ".mp4", "MPEG2",
    "(複号同順)", "作用点", "カトラリー", "アポカリプス", "ギャラクティカ", "ダンシング", "魔女の家", "モディファイア",
    "スプリット", "信じるな", "Lose Your Self", "映す未来", "鎖骨砕き", "抱え落ち", "4px", "音MAD", "ジェノサイド",
    "入れてたも", "エスニック", "コンポジション", "トンファーキック", "Without Me", "横流し", "俺が医者", "これは嘘",
    "未来予知", "動く床", "パニカンで", "ケンタッキー", "DDT", "目が眩み", "3秒ルール"
]

const haikuSevens = [
    "あえてあえての", "母の故郷で", "対空無敵の", "絶対安心", "ザッツアグレート", "「それはどうかな」", "チャンスメーカー",
    "[ここで画像を挿入]", "[ここで気の利いたジョークを披露]", "魑魅魍魎の", "それはあいつの", "236P", "5700", "奈良にいこうよ",
    "デスクライトの", "クーラーガンガン", "真夏の醍醐味", "「Jammo Ja!」", "選ばれたのは", "汚名を着せられ", "再提出でも",
    "それは許さん", "逆に", "スポンジボブの", "ランダマイザー", "ユニットバスでの", "破壊衝動", "雛を育てて", "逆張り性の",
    "お茶しましょうね", "名称不明の", "ワイルドカードの", "目に入らぬか", "これは汚い", "「娘をよろしく」", "末端冷え性",
    "文明開化の", "ダイヤモンドは", "蛙飛び込む", "クリーンヒット", "ハイドロポンプで", "時計回りに", "IEEE(アイトリプルイー)", "生きるか死ぬか",
    "いけしゃあしゃあと", "ガキの使いや", "試行錯誤の", "動脈流そう", "気づけばそこに", "低温調理の", "栄養満点", "新規プレイヤー",
    "欲に塗れた", "さ、魅せますか", "計画的な", "トリックスターの", "いともたやすく", "人智を超えた", "早めの", "オカルトチックな",
    "SAN値チェックで", "桜の木の下", "スペルチェックと", "信用しない", "AI風情が", "アカンパニーオン", "キリングスプリー",
    "外郎売の", "お涙頂戴", "勧善懲悪", "完全感覚", "がらぴいがらぴい", "転売ヤーの", "生かさず殺さず", "丸サ進行", "サインコサイン",
    "死にたくなければ", "コンプラ違反の", "人生舐めずに", "大志を抱け", "無罪放免", "そいじゃここらで", "冷やし中華と", "生き様定めて",
    "いやに涼しい", "セカンドチャンスの", "リーヅモ一発", "明日降る雨", "ポッケにある飴", "感情爆発", "不正投票", "人造人間",
    "便乗ユーモア", "冷笑的な", "まったくもって", "なんでこんなに", "ノーモーションで", "ネットミームで", "運否天賦の",
    "「舐められたもんだ」", "ACDC", "ホップステップ", "Vtuberへの", "併殺区間で", "津々浦々に", "「終わらせねぇよ！」",
    "デバック不足の", "常識外れの", "奇想天外", "もみあげ殺しの", "ちらちら見える", "メガロポリスに", "みなさんご存じ",
    "今夜は飲むぞ", "予想通りの", "奇蹟遍く", "ロケットジャンプで", "DJイベント", "検挙不能の", "迷宮入りの", "頭脳は大人の",
    "11バックで", "「来た、見た、勝った」", "二重スリット", "ガード不能の", "ロコモコ 心も", "違法な行動", "突飛な行動", "退屈させない",
    "起き攻め重視の", "反省してまーす", "盗塁王に", "海賊王に", "右腕失い", "世界征服", "午前三時の", "浅き夢見じ", "準備完了",
    "再帰関数", "忘れていったよ", "まっすぐ行って", "右ストレートで", "画面端での", "「笑っちゃうよね」", "超高速の", "サイドキックと",
    "ダイナミックな", "すべての関節", "混沌極まる", "自分勝手な", "undefined", "相も変わらず", "ほれ見たことか", "レスポンシブな",
    "六畳一間", "あまり私を", "集めて早し", "待ってたんだよ", "俺は貴様を", "人生論者が", "故に我あり", "生き残れない！",
    "終わりをもたらす", "放送事故で", "じわじわ効きよる", "ニコニコ動画", "ネット依存の", "ダブルアップだ", "人間不信の",
    "ここは普通に", "かゆみ止まらぬ", "メケメケメケメケ", "冷えたビールと", "独りよがりな", "一人ぼっちの", "\"Bluetooth Connected\"",
    "バブルソートと", "アンダーカバーの", "目覚まし時計の", "竜巻旋風", "死者へのぼうとく", "カメオ出演", "ディアゴスティーニ", "逆から読んだら",
    "しても", "おおおおおおお", "感謝感激", "見知らぬ街に", "発注三桁", "孤独な姿", "過剰包装", "三十五度目の", "ぎちりぎちりと",
    "淋しさを知らぬ", "あの日の夢は", "マナー知らずの", "逃げるは恥だが", "恥を知らない", "インフルエンザで", "記憶に残らぬ",
    "これで終わりだ", "観念しろや", "ウルトラスーパー", "この異常性", "馬鹿と鋏は", "先天的な", "天文学的", "ナフサ不足で",
    "事実上の敵", "エッサホイサと", "死を恐れない", "タンクローリー", "ペナルティマン", "2Pカラーの", "ハイパーボリック", "13日の",
    "アウフタクト", "ミューティレーション", "光線銃で", "責任放棄で", "メスシリンダー", "ペットボトルを", "初見殺しの", "100万ドルの",
    "ソイヤソイヤと", "摩擦係数", "すもももももも", "赤いエリアに", "匿名希望の", "名誉終身", "霞ヶ浦で", "ねじれの位置で",
    "掟破りの", "1万回転", "ローグライク", "今までを捨てて", "文学的な", "「邪魔だねこれ」", "ハーフブロック", "Quadrilateral",
    "流血沙汰の", "うかがい知れない", "オレオレオレオレ", "スクリューパイル", "オーバードライブ", "たまごください", "キャンセル界隈",
    "横揺れ界隈", "世界も終わり", "絶望的な", "関係がある", "今わの際で", "間違っていても", "ファイアワークス", "ウェルカムトゥーザ",
    "脳腐れ共の", "支点力点", "余白が足りず", "底辺掛ける", "聖人君主を", "毎時毎分", "ポーカーフェイス", "ブレイクファストに",
    "通信エラーで", "関西全域", "関東全域", "レ(返り点)", "息もできない", "ブラウン管に", "波打ち際に", "中段攻撃", "二、三個爆弾",
    "中点連結", "自己満足の", "ウォーターサーバー", "決めちゃれ決めちゃれ", "狂気で出来た", "そんじゃそこらの", "まさかりかついだ"
]

console.log(`fives:${haikuFives.length}, sevens: ${haikuSevens.length}`);


function HaikuGenerate(){
    let haiku = "";
    let rnd = Math.floor(Math.random() * haikuFives.length);
    haiku += haikuFives[rnd] + "<br>";
    rnd = Math.floor(Math.random() * haikuSevens.length);
    haiku += haikuSevens[rnd] + "<br>";
    rnd = Math.floor(Math.random() * haikuFives.length);
    haiku += haikuFives[rnd];
    textbox.innerHTML = haiku;
}

window.onload = () => {HaikuGenerate()}

rerollBtn.addEventListener("click", () => {HaikuGenerate()});
